import React from 'react';

const License = () => {
  const licenseText = `  Ліцензія
  ============
  
  Студент групи ІПЗк-21-1 Дацкевич Владислав. В проекті створена картка ( з переключанням, а саме одна з картинкою інша без) та  кнопка ( для порівняння зробив 2, щоб дивитись активну та не активну одночасно)
  p.s. Параметри можна змінювати на сторінці сторібуку

  До кнопки я додав такі значення:
  text - для зміни тексту
  onClick - подія відбувається коли ви робите один клік, при натискані буде показувати кількість кліків в "Actions"
  color - колір
  size - загальний задаваємий розмір кнопки
  disabled - вказує активна чи не активна кнопка
  
  До картки додав наступне:
  description - опис сторінки
  title - заголовок
  content - довільний текст
  image - картинка
  backgroundColor - задній фона
  borderRadius - завдання окружності всіх кутів одночасно `;

  return (
    <div>
      <h1>Ліцензія</h1>
      <pre>{licenseText}</pre>
    </div>
  );
};

export default License;
